mochimochi-man/np2_espresso/sdkconfig.defaults
# ESP32-S3 N16R8: 8MB Octal PSRAM, 16MB flash
CONFIG_IDF_TARGET="esp32s3"

# --- PSRAM (Octal) + allow static .bss in external RAM (the whole point of Path B) ---
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=n

# --- Flash / partitions ---
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- Arduino as component needs 1kHz tick ---
CONFIG_FREERTOS_HZ=1000

# --- app main task: give the emulator a big stack ---
CONFIG_ESP_MAIN_TASK_STACK_SIZE=32768

# --- size opt for the large core ---
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_CXX_EXCEPTIONS=y

# --- console on UART0 ---
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# --- max CPU speed ---
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

# --- give the emulator loop room; relax task WDT ---
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
# 32B is the widest line the S3 instruction cache offers (64B is data-cache
# only). This used to say _64B, which Kconfig rejected as an unknown symbol and
# silently left at the 32B default — same setting, plus a warning every build.
CONFIG_ESP32S3_INSTRUCTION_CACHE_LINE_32B=y
CONFIG_TFT_eSPI_ESPIDF=y
CONFIG_TFT_ST7789_DRIVER=y
CONFIG_TFT_BGR_ORDER=y
CONFIG_TFT_WIDTH=240
CONFIG_TFT_HEIGHT=320
CONFIG_TFT_INVERSION_ON=y
CONFIG_TFT_HSPI_PORT=y
CONFIG_TFT_MISO=-1
CONFIG_TFT_MOSI=11
CONFIG_TFT_SCLK=12
CONFIG_TFT_CS=10
CONFIG_TFT_DC=9
CONFIG_TFT_RST=-1
CONFIG_TFT_SPI_FREQUENCY=80000000
CONFIG_TFT_SPI_READ_FREQ=16000000
CONFIG_TFT_LOAD_FONT2=y
# CONFIG_ENABLE_BL is not set

# --- USB hub support (keyboard+mouse via self-powered hub) ---
CONFIG_USB_HOST_HUBS_SUPPORTED=y
CONFIG_COMPILER_DISABLE_DEFAULT_ERRORS=y
